# DataFrame

In [139]:
# Jupyter Notebook 설정 : 모든 결과 출력
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [140]:
# DeprecationWarning / FutureWarning(차후 버전에서 없어질 기능이니 미리 경고하는 것) 끄기
import warnings
warnings.filterwarnings("ignore", category=DeprecationWarning)
warnings.filterwarnings("ignore", category=FutureWarning)

In [258]:
import pandas as pd
import numpy as np

width = 77
line = "-" * width
df = pd.DataFrame(np.arange(10,22).reshape(3,4), index=["a","b","c"], columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [142]:
for column_name, column_series in df.items():
    print(type(column_name), column_name)
    for index_key, cell_value in column_series.items():
        print(index_key, cell_value)

<class 'str'> A
a 10
b 14
c 18
<class 'str'> B
a 11
b 15
c 19
<class 'str'> C
a 12
b 16
c 20
<class 'str'> D
a 13
b 17
c 21

## indexing & Slicing

In [263]:
print("# df \n", type(df))
df
print("\n# Column 기준으로 처리")
column_series = df["B"] # Series
print('\ndf["B"]\n', type(column_series), '\n', column_series)
column_df = df[["B","C"]] # DataFrame
print('\ndf[["B","C"]]\n', type(column_df), '\n', column_df)
#column_df = df["B","C"] # column slicing 처리 불가 (row slicing으로 처리되기 때문)
print("\n# Row 기준으로 처리 : DataFrame.index 리스트의 index를 기준으로 처리, df[start_index : stop_index-1]")
row_df = df[1:2] 
print('\ndf[1:2]\n', type(row_df), '\n', row_df)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

# Column 기준으로 처리

df["B"]
 <class 'pandas.core.series.Series'>
 a    11
b    15
c    19
Name: B, dtype: int64

df[["B","C"]]
 <class 'pandas.core.frame.DataFrame'>
     B   C
a  11  12
b  15  16
c  19  20

# Row 기준으로 처리 : DataFrame.index 리스트의 index를 기준으로 처리, df[start_index : stop_index-1]

df[1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

In [264]:
print("# df \n", type(df))
df
print(line)
print("\n# Row 기준으로 slicing 처리")
temp = df[1:3] # DataFrame (DataFrame.index 리스트의 index 기준)
print('\ndf[1:3]', type(temp), '\n', temp)
temp = df.iloc[1:3] # DataFrame (DataFrame.index 리스트의 index 기준)
print('\ndf.iloc[1:3]', type(temp), '\n', temp)
temp = df["b":"c"] # DataFrame (DataFrame.index 리스트의 value 기준)
print('\ndf["b":"c"]', type(temp), '\n', temp)
temp = df.loc[['b','c']] # DataFrame (DataFrame.index 리스트의 value 기준)
print('\ndf.loc[["b","c"]]', type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

-----------------------------------------------------------------------------

# Row 기준으로 slicing 처리

df[1:3] <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

df.iloc[1:3] <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

df["b":"c"] <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

df.loc[["b","c"]] <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

### Column

In [262]:
print("# df \n", type(df))
df
temp = df["B"] # Series
print('\n# df["B"]\n', type(temp), '\n', temp)
temp = df["B"][:] # Series
print('\n# df["B"][:]\n', type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

# df["B"]
 <class 'pandas.core.series.Series'>
 a    11
b    15
c    19
Name: B, dtype: int64

# df["B"][:]
 <class 'pandas.core.series.Series'>
 a    11
b    15
c    19
Name: B, dtype: int64

In [265]:
print("# df \n", type(df))
df
column_series = df["B"][:"b"] # Series의 slicing (column 기준)
print('\n# df["B"][:"b"]\n', type(column_series))
column_series
print(line)
series1 = df['B']
print('\n# s1 = df["B"]\n', type(series1), '\n', series1)
series2 = series1[:'b']
print('\n# s2 = s1[:"b"]\n', type(series2), '\n', series2)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

# df["B"][:"b"]
 <class 'pandas.core.series.Series'>

a    11
b    15
Name: B, dtype: int64

-----------------------------------------------------------------------------

# s1 = df["B"]
 <class 'pandas.core.series.Series'>
 a    11
b    15
c    19
Name: B, dtype: int64

# s2 = s1[:"b"]
 <class 'pandas.core.series.Series'>
 a    11
b    15
Name: B, dtype: int64

In [261]:
print("# df \n", type(df))
df
temp = df[["B"]] # DataFrame
print('\n# df[["B"]] \n', type(temp))
temp
temp = df[["B","C","D"]] # DataFrame
print('\n# df[["B","C","D"]] \n', type(temp))
temp
temp = df[["B","C","D"]]["B"] # Series (column)
print('\n# df[["B","C","D"]]["B"] \n', type(temp))
temp
temp = df[["B","C","D"]].loc["a"] # Series (row)
print('\n# df[["B","C","D"]].loc["a"] \n', type(temp))
temp
#temp = df[["B","D"], "a"] # InvalidIndexError

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

# df[["B"]]
 <class 'pandas.core.frame.DataFrame'>

    B
a  11
b  15
c  19

# df[["B","C","D"]]
 <class 'pandas.core.frame.DataFrame'>

    B   C   D
a  11  12  13
b  15  16  17
c  19  20  21

# df[["B","C","D"]]["B"]
 <class 'pandas.core.series.Series'>

a    11
b    15
c    19
Name: B, dtype: int64

# df[["B","C","D"]].loc["a"]
 <class 'pandas.core.series.Series'>

B    11
C    12
D    13
Name: a, dtype: int64

### Row

In [269]:
print("# df \n", type(df))
df
temp = df.loc["a"] # Series
print('\n df.loc["a"] \n', type(temp), '\n', temp)
temp = df.loc["a", :] # Series
print('\n df.loc["a", :] \n', type(temp), '\n', temp)
temp = df.loc["a", "B":"C"] # Series
print('\n df.loc["a", "B":"C"] \n', type(temp), '\n', temp)
temp = df.loc["a", ["B","C"]] # Series
print('\n df.loc["a", ["B","C"]] \n', type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc["a"]
 <class 'pandas.core.series.Series'>
 A    10
B    11
C    12
D    13
Name: a, dtype: int64

 df.loc["a", :]
 <class 'pandas.core.series.Series'>
 A    10
B    11
C    12
D    13
Name: a, dtype: int64

 df.loc["a", "B":"C"]
 <class 'pandas.core.series.Series'>
 B    11
C    12
Name: a, dtype: int64

 df.loc["a", ["B","C"]]
 <class 'pandas.core.series.Series'>
 B    11
C    12
Name: a, dtype: int64

In [270]:
print("# df \n", type(df))
df
temp = df.loc[['a']] # DataFrame
print("\n df.loc[['a']] \n", type(temp), '\n', temp)
temp = df.loc[['a'], :] # DataFrame
print("\n df.loc[['a'], :] \n", type(temp), '\n', temp)
temp = df.loc['a':'a'] # DataFrame
print("\n df.loc['a':'a'] \n", type(temp), '\n', temp)
temp = df.iloc[0:1] # DataFrame
print("\n df.iloc[0:1] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc[['a']]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13

 df.loc[['a'], :]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13

 df.loc['a':'a']
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13

 df.iloc[0:1]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13

In [271]:
print("# df \n", type(df))
df
temp = df.loc[['a'], 'B':'C'] # DataFrame
print("\n df.loc[['a'], 'B':'C'] \n", type(temp), '\n', temp)
temp = df.loc[['a'], ['B','C']] # DataFrame
print("\n df.loc[['a'], ['B','C']] \n", type(temp), '\n', temp)
temp = df.loc[['a','c']] # DataFrame
print("\n df.loc[['a','c']] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc[['a'], 'B':'C']
 <class 'pandas.core.frame.DataFrame'>
     B   C
a  11  12

 df.loc[['a'], ['B','C']]
 <class 'pandas.core.frame.DataFrame'>
     B   C
a  11  12

 df.loc[['a','c']]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
c  18  19  20  21

### Cell

In [153]:
print(type(df['A']['a']), df['A']['a']) # df['A','a'] : Error

<class 'numpy.int64'> 10

In [154]:
print(df.loc['a',"A"], df.loc['a']["A"])
print(df.iloc[0,0])
print(df.iloc[0][0]) # FutureWarning

10 10
10
10

### 중요

In [272]:
print("# df \n", type(df))
df
temp = df.loc[['a','b']]['A'] # Series
print("\n df.loc[['a','b']]['A'] \n", type(temp), '\n', temp)
temp = df.loc[['a','b'],'A'] # Series
print("\n df.loc[['a','b'],'A'] \n", type(temp), '\n', temp)
temp = df.loc[['a','b'],['A']] # DataFrame
print("\n df.loc[['a','b'],['A']] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc[['a','b']]['A']
 <class 'pandas.core.series.Series'>
 a    10
b    14
Name: A, dtype: int64

 df.loc[['a','b'],'A']
 <class 'pandas.core.series.Series'>
 a    10
b    14
Name: A, dtype: int64

 df.loc[['a','b'],['A']]
 <class 'pandas.core.frame.DataFrame'>
     A
a  10
b  14

In [274]:
print("# df \n", type(df))
df
temp = df.loc['a'] # Series
print("\n df.loc['a'] \n", type(temp), '\n', temp)
temp = df.loc[['a']] # DataFrame
print("\n df.loc[['a']] \n", type(temp), '\n', temp)
temp = df.loc['a', :] # Series
print("\n df.loc['a', :] \n", type(temp), '\n', temp)
temp = df.loc[['a'], :] # DataFrame
print("\n df.loc[['a'], :] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc['a']
 <class 'pandas.core.series.Series'>
 A    10
B    11
C    12
D    13
Name: a, dtype: int64

 df.loc[['a']]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13

 df.loc['a', :]
 <class 'pandas.core.series.Series'>
 A    10
B    11
C    12
D    13
Name: a, dtype: int64

 df.loc[['a'], :]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13

In [276]:
print("# df \n", type(df))
df
temp = df.loc['b':] # DataFrame
print("\n df.loc['b':] \n", type(temp), '\n', temp)
temp = df.loc['b':,'A'] # Series
print("\n df.loc['b':,'A'] \n", type(temp), '\n', temp)
temp = df.loc['b':]['A'] # Series
print("\n df.loc['b':]['A'] \n", type(temp), '\n', temp)
temp = df.loc['b':][['A']] # DataFrame
print("\n df.loc['b':][['A']] \n", type(temp), '\n', temp)
temp = df.loc['b':,['A']] # DataFrame
print("\n df.loc['b':,['A']] \n", type(temp), '\n', temp)
temp = df.loc['b':,'A':'A'] # DataFrame
print("\n df.loc['b':,'A':'A'] \n", type(temp), '\n', temp)
temp = df.loc['b':]['b':'b'] # DataFrame ???????
print("\n df.loc['b':]['b':'b'] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc['b':]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

 df.loc['b':,'A']
 <class 'pandas.core.series.Series'>
 b    14
c    18
Name: A, dtype: int64

 df.loc['b':]['A']
 <class 'pandas.core.series.Series'>
 b    14
c    18
Name: A, dtype: int64

 df.loc['b':][['A']]
 <class 'pandas.core.frame.DataFrame'>
     A
b  14
c  18

 df.loc['b':,['A']]
 <class 'pandas.core.frame.DataFrame'>
     A
b  14
c  18

 df.loc['b':,'A':'A']
 <class 'pandas.core.frame.DataFrame'>
     A
b  14
c  18

 df.loc['b':]['b':'b']
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

In [277]:
print("# df \n", type(df))
df
temp = df['a':'b'] # DataFrame
print("\n df['a':'b'] \n", type(temp), '\n', temp)
temp = df.loc['a':'b'] # DataFrame
print("\n df.loc['a':'b'] \n", type(temp), '\n', temp)
temp = df.loc[['a','b']] # DataFrame
print("\n df.loc[['a','b']] \n", type(temp), '\n', temp)
temp = df.loc[['a','b']][['B','D']] # DataFrame
print("\n df.loc[['a','b']][['B','D']] \n", type(temp), '\n', temp)
temp = df.loc[['a','b'],['B','D']] # DataFrame
print("\n df.loc[['a','b'],['B','D']] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df['a':'b']
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17

 df.loc['a':'b']
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17

 df.loc[['a','b']]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17

 df.loc[['a','b']][['B','D']]
 <class 'pandas.core.frame.DataFrame'>
     B   D
a  11  13
b  15  17

 df.loc[['a','b'],['B','D']]
 <class 'pandas.core.frame.DataFrame'>
     B   D
a  11  13
b  15  17

In [278]:
print("# df \n", type(df))
df
temp = df[1:2]
print("\n df[1:2] \n", type(temp), '\n', temp)
temp = df.iloc[1:2]
print("\n df.iloc[1:2] \n", type(temp), '\n', temp)
temp = df['b':'b']
print("\n df['b':'b'] \n", type(temp), '\n', temp)
temp = df.loc['b':'b']
print("\n df.loc['b':'b'] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df[1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

 df.iloc[1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

 df['b':'b']
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

 df.loc['b':'b']
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

In [279]:
print("# df \n", type(df))
df
temp = df.iloc[0,1]
print("\n df.iloc[0,1] \n", type(temp), '\n', temp)
temp = df.iloc[0:2,1:2]
print("\n df.iloc[0:2,1:2] \n", type(temp), '\n', temp)
temp = df.iloc[0:2][1:2]
print("\n df.iloc[0:2][1:2] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.iloc[0,1]
 <class 'numpy.int64'>
 11

 df.iloc[0:2,1:2]
 <class 'pandas.core.frame.DataFrame'>
     B
a  11
b  15

 df.iloc[0:2][1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

#### index가 1부터 시작되는 정수인 경우 df[1:2] 결과는?

In [281]:
df1 = pd.DataFrame(np.arange(10,22).reshape(3,4), index=[1,3,2], columns=['A','B','C','D'])
print(type(df1.index), df1.index)
print(type(df1), "df1")
df1
temp = df1[1:2] # DataFrame.index 리스트의 index 사용
print("\n df1[1:2] \n", type(temp), '\n', temp)
temp = df1.iloc[1:2] # DataFrame.index 리스트의 index 사용
print("\n df1.iloc[1:2] \n", type(temp), '\n', temp)
temp = df1.loc[1:2] # 생성시 주어진 index를 기준으로 처리
print("\n df1.loc[1:2] \n", type(temp), '\n', temp)
print(type(df1.index), '\n', df1.index)

<class 'pandas.core.indexes.base.Index'> Index([1, 3, 2], dtype='int64')
<class 'pandas.core.frame.DataFrame'> df1

    A   B   C   D
1  10  11  12  13
3  14  15  16  17
2  18  19  20  21

 df1[1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
3  14  15  16  17

 df1.iloc[1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
3  14  15  16  17

 df1.loc[1:2]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
1  10  11  12  13
3  14  15  16  17
2  18  19  20  21
<class 'pandas.core.indexes.base.Index'>
 Index([1, 3, 2], dtype='int64')

In [282]:
df2 = pd.DataFrame(np.arange(10,22).reshape(3,4), columns=['A','B','C','D'])
print(type(df2.index), df2.index)
print(type(df2), "df2")
df2
temp = df2[1:2]
print("\n# df2[1:2] : ", type(temp), '\n', temp)
temp = df2.iloc[1:2]
print("\n# df2.iloc[1:2] : ", type(temp), '\n', temp)
temp = df2.loc[1:2]
print("\n# df2.loc[1:2] : ", type(temp), '\n', temp)

<class 'pandas.core.indexes.range.RangeIndex'> RangeIndex(start=0, stop=3, step=1)
<class 'pandas.core.frame.DataFrame'> df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

# df2[1:2] :  <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
1  14  15  16  17

# df2.iloc[1:2] :  <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
1  14  15  16  17

# df2.loc[1:2] :  <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
1  14  15  16  17
2  18  19  20  21

## Row Selection

### df[bool_type_series]

In [286]:
print("# df \n", type(df))
df
temp = df[df["B"] > 11]
print("\n df[df['B'] > 11] \n", type(temp), '\n', temp)

s = df["B"] > 11
print("\n step1. s = df['B'] > 11 \n", type(s), '\n', s)
temp = df[s]
print("\n step2. df[s] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df[df['B'] > 11]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

 step1. s = df['B'] > 11
 <class 'pandas.core.series.Series'>
 a    False
b     True
c     True
Name: B, dtype: bool

 step2. df[s]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [288]:
print("# df \n", type(df))
df
s = pd.Series([False,True,False], index=['a','b','c'])
print("\n s \n", type(s), '\n', s)
temp = df[s]
print("\n df[s] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 s
 <class 'pandas.core.series.Series'>
 a    False
b     True
c    False
dtype: bool

 df[s]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
b  14  15  16  17

### df.loc[bool_type_series]

In [289]:
print("# df \n", type(df))
df
temp = df.loc[df.A > 15]
print("\n df.loc[df.A > 15] \n", type(temp), '\n', temp)
s = df.A > 15
print("\n step1. s = df.A > 15 \n", type(s), '\n', s)
temp = df.loc[s]
print("\n step2. df.loc[s] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 df.loc[df.A > 15]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
c  18  19  20  21

 step1. s = df.A > 15
 <class 'pandas.core.series.Series'>
 a    False
b    False
c     True
Name: A, dtype: bool

 step2. df.loc[s]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
c  18  19  20  21

In [291]:
print("# df \n", type(df))
df
s = pd.Series([True,True,False], index=['a','b','c'])
print("\n s \n", type(s), '\n', s)
temp = df.loc[s]
print("\n df.loc[s] \n", type(temp), '\n', temp)

# df
 <class 'pandas.core.frame.DataFrame'>

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

 s
 <class 'pandas.core.series.Series'>
 a     True
b     True
c    False
dtype: bool

 df.loc[s]
 <class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17

## Function

### info()

In [167]:
temp = df.info()
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
 3   D       3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes
<class 'NoneType'>
 None

### describe()

In [168]:
temp = df.describe()
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
           A     B     C     D
count   3.0   3.0   3.0   3.0
mean   14.0  15.0  16.0  17.0
std     4.0   4.0   4.0   4.0
min    10.0  11.0  12.0  13.0
25%    12.0  13.0  14.0  15.0
50%    14.0  15.0  16.0  17.0
75%    16.0  17.0  18.0  19.0
max    18.0  19.0  20.0  21.0

### value_counts()

In [169]:
print(type(df), '\n', df)
df1 = df.copy()
print(id(df1) == id(df)) # False (깊은복사)
print(id(df1['A']) == id(df['A'])) # False (깊은복사)
print(id(df1.loc['a']) == id(df.loc['a'])) # True (얕은복사)
#
df1.loc['d'] = [10,11,12,13] # 행 추가
print(type(df1), '\n', df1)
vc = df1.value_counts()
print(type(vc), '\n', vc)
vc = df['A'].value_counts()
print(type(vc), '\n', vc)
vc = df['A'].value_counts(normalize=True)
print(type(vc), '\n', vc)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
False
False
True
<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
d  10  11  12  13
<class 'pandas.core.series.Series'>
 A   B   C   D
10  11  12  13    2
14  15  16  17    1
18  19  20  21    1
Name: count, dtype: int64
<class 'pandas.core.series.Series'>
 A
10    1
14    1
18    1
Name: count, dtype: int64
<class 'pandas.core.series.Series'>
 A
10    0.333333
14    0.333333
18    0.333333
Name: proportion, dtype: float64

### count(axis=0) : NaN은 포함시키지 않음

In [170]:
print(type(df), '\n', df)
temp = df.count() # axis=0
print(type(temp), '\n', temp)
temp = df.count(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    3
B    3
C    3
D    3
dtype: int64
<class 'pandas.core.series.Series'>
 a    4
b    4
c    4
dtype: int64

### sum(axis=0) : 합계

In [171]:
print(type(df), '\n', df)
temp = df.sum() # axis=0
print(type(temp), '\n', temp)
temp = df.sum(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    42
B    45
C    48
D    51
dtype: int64
<class 'pandas.core.series.Series'>
 a    46
b    62
c    78
dtype: int64

### mean(axis=0) : 평균

In [172]:
print(type(df), '\n', df)
temp = df.mean() # axis=0
print(type(temp), '\n', temp)
temp = df.mean(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    14.0
B    15.0
C    16.0
D    17.0
dtype: float64
<class 'pandas.core.series.Series'>
 a    11.5
b    15.5
c    19.5
dtype: float64

### min(axis=0) : 최소

In [173]:
print(type(df), '\n', df)
temp = df.min() # axis=0
print(type(temp), '\n', temp)
temp = df.min(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    10
B    11
C    12
D    13
dtype: int64
<class 'pandas.core.series.Series'>
 a    10
b    14
c    18
dtype: int64

### max(axis=0) : 최대

In [174]:
print(type(df), '\n', df)
temp = df.max() # axis=0
print(type(temp), '\n', temp)
temp = df.max(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    18
B    19
C    20
D    21
dtype: int64
<class 'pandas.core.series.Series'>
 a    13
b    17
c    21
dtype: int64

### var(axis=0) : 분산

In [175]:
print(type(df), '\n', df)
temp = df.var() # axis=0
print(type(temp), '\n', temp)
temp = df.var(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    16.0
B    16.0
C    16.0
D    16.0
dtype: float64
<class 'pandas.core.series.Series'>
 a    1.666667
b    1.666667
c    1.666667
dtype: float64

### std(axis=0) : 표준편차

In [176]:
print(type(df), '\n', df)
temp = df.std() # axis=0
print(type(temp), '\n', temp)
temp = df.std(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    4.0
B    4.0
C    4.0
D    4.0
dtype: float64
<class 'pandas.core.series.Series'>
 a    1.290994
b    1.290994
c    1.290994
dtype: float64

### median(axis=0) : 중앙값

In [177]:
print(type(df), '\n', df)
temp = df.median() # axis=0
print(type(temp), '\n', temp)
temp = df.median(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    14.0
B    15.0
C    16.0
D    17.0
dtype: float64
<class 'pandas.core.series.Series'>
 a    11.5
b    15.5
c    19.5
dtype: float64

### quantile(q, ...) : 백분위수

In [178]:
print(type(df), '\n', df)
temp = df.quantile(0.5) # 중앙값
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.series.Series'>
 A    14.0
B    15.0
C    16.0
D    17.0
Name: 0.5, dtype: float64

### sort_values(by=[], ascending=True)

In [179]:
print(type(df), '\n', df)
temp = df.sort_values(by='C')
print(type(temp), '\n', temp)
print(id(temp) == id(df)) # False
print(id(temp.iloc[0]) == id(df.iloc[0])) # True

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
False
True

In [180]:
print(type(temp), '\n', temp)
temp = df.sort_values(by=['C','B'], ascending=False)
print(type(temp), '\n', temp)
print(id(temp) == id(df)) # False
print(id(temp.iloc[0]) == id(df.iloc[0])) # True

<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
<class 'pandas.core.frame.DataFrame'>
     A   B   C   D
c  18  19  20  21
b  14  15  16  17
a  10  11  12  13
False
True

### sort_index(ascending=True)

In [181]:
df1 = pd.DataFrame({'num_legs':[2,4,4,5], 'num_wings':[2,0,0,0]}, index=['falcon','cat','dog','ant'])
df1

        num_legs  num_wings
falcon         2          2
cat            4          0
dog            4          0
ant            5          0

In [182]:
temp = df1.sort_index()
print(type(temp), '\n', temp)
print(type(df1), '\n', df1)

<class 'pandas.core.frame.DataFrame'>
         num_legs  num_wings
ant            5          0
cat            4          0
dog            4          0
falcon         2          2
<class 'pandas.core.frame.DataFrame'>
         num_legs  num_wings
falcon         2          2
cat            4          0
dog            4          0
ant            5          0

In [183]:
temp = df1.sort_index(ascending=False)
print(type(temp), '\n', temp)
print(type(df1), '\n', df1)

<class 'pandas.core.frame.DataFrame'>
         num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            5          0
<class 'pandas.core.frame.DataFrame'>
         num_legs  num_wings
falcon         2          2
cat            4          0
dog            4          0
ant            5          0

### drop(index, columns, inplace=False ...)

In [184]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [185]:
df2.loc['max'] = df2.max()
df2.loc['min'] = df2.min(axis=0)
df2['sum'] = df2[[0,1,2,3,4,5,6,7]].sum(axis=1)
df2

     0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
max  9  9  9  9  9  7  4  7   63
min  4  7  2  4  0  0  0  1   18

In [186]:
print(type(df2), '\n', df2)
temp = df2.drop(index=['max','min'])
print(type(temp), '\n', temp)
print(type(df2), '\n', df2)

<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
max  9  9  9  9  9  7  4  7   63
min  4  7  2  4  0  0  0  1   18
<class 'pandas.core.frame.DataFrame'>
    0  1  2  3  4  5  6  7  sum
0  5  8  9  5  0  0  1  7   35
1  6  9  2  4  5  2  4  2   34
2  4  7  7  9  1  7  0  6   41
3  9  9  7  6  9  1  0  1   42
<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
max  9  9  9  9  9  7  4  7   63
min  4  7  2  4  0  0  0  1   18

In [187]:
print(type(df2), '\n', df2)
temp = df2.drop(index='max', inplace=True)
print(type(temp), '\n', temp)
print(type(df2), '\n', df2)

<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
max  9  9  9  9  9  7  4  7   63
min  4  7  2  4  0  0  0  1   18
<class 'NoneType'>
 None
<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
min  4  7  2  4  0  0  0  1   18

In [188]:
print(type(df2), '\n', df2)
temp = df2.drop(columns=['sum',0])
print(type(temp), '\n', temp)
print(type(df2), '\n', df2)

<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
min  4  7  2  4  0  0  0  1   18
<class 'pandas.core.frame.DataFrame'>
      1  2  3  4  5  6  7
0    8  9  5  0  0  1  7
1    9  2  4  5  2  4  2
2    7  7  9  1  7  0  6
3    9  7  6  9  1  0  1
min  7  2  4  0  0  0  1
<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
min  4  7  2  4  0  0  0  1   18

In [189]:
print(type(df2), '\n', df2)
temp = df2.drop(columns='sum', inplace=True)
print(type(temp), '\n', temp)
print(type(df2), '\n', df2)

<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7  sum
0    5  8  9  5  0  0  1  7   35
1    6  9  2  4  5  2  4  2   34
2    4  7  7  9  1  7  0  6   41
3    9  9  7  6  9  1  0  1   42
min  4  7  2  4  0  0  0  1   18
<class 'NoneType'>
 None
<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7
0    5  8  9  5  0  0  1  7
1    6  9  2  4  5  2  4  2
2    4  7  7  9  1  7  0  6
3    9  9  7  6  9  1  0  1
min  4  7  2  4  0  0  0  1

In [190]:
print(type(df2), '\n', df2)
temp = df2.drop(index=[1,2], columns=[1,3,5,7])
print(type(temp), '\n', temp)
print(type(df2), '\n', df2)

<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7
0    5  8  9  5  0  0  1  7
1    6  9  2  4  5  2  4  2
2    4  7  7  9  1  7  0  6
3    9  9  7  6  9  1  0  1
min  4  7  2  4  0  0  0  1
<class 'pandas.core.frame.DataFrame'>
      0  2  4  6
0    5  9  0  1
3    9  7  9  0
min  4  2  0  0
<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7
0    5  8  9  5  0  0  1  7
1    6  9  2  4  5  2  4  2
2    4  7  7  9  1  7  0  6
3    9  9  7  6  9  1  0  1
min  4  7  2  4  0  0  0  1

In [191]:
print(type(df2), '\n', df2)
temp = df2.drop(index=[1,2], columns=[1,3,5,7], inplace=True)
print(type(temp), '\n', temp)
print(type(df2), '\n', df2)

<class 'pandas.core.frame.DataFrame'>
      0  1  2  3  4  5  6  7
0    5  8  9  5  0  0  1  7
1    6  9  2  4  5  2  4  2
2    4  7  7  9  1  7  0  6
3    9  9  7  6  9  1  0  1
min  4  7  2  4  0  0  0  1
<class 'NoneType'>
 None
<class 'pandas.core.frame.DataFrame'>
      0  2  4  6
0    5  9  0  1
3    9  7  9  0
min  4  2  0  0

### dropna(axis, inplace=False)

In [192]:
df3 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df3.loc[2,3] = np.nan
df3.loc[1,5] = np.nan
print(type(df3), '\n', df3)

<class 'pandas.core.frame.DataFrame'>
    0  1  2    3  4    5  6  7
0  8  8  3  9.0  8  7.0  3  6
1  5  1  9  3.0  4  NaN  1  4
2  0  3  9  NaN  0  4.0  9  2
3  7  7  9  8.0  6  9.0  3  7

In [193]:
print(type(df3), '\n', df3)
temp = df3.dropna(axis=0) # 행 제거
print(type(temp), '\n', temp)
temp = df3.dropna(axis=1, inplace=True) # 열 제거
print(type(temp), '\n', temp)
print(type(df3), '\n', df3)

<class 'pandas.core.frame.DataFrame'>
    0  1  2    3  4    5  6  7
0  8  8  3  9.0  8  7.0  3  6
1  5  1  9  3.0  4  NaN  1  4
2  0  3  9  NaN  0  4.0  9  2
3  7  7  9  8.0  6  9.0  3  7
<class 'pandas.core.frame.DataFrame'>
    0  1  2    3  4    5  6  7
0  8  8  3  9.0  8  7.0  3  6
3  7  7  9  8.0  6  9.0  3  7
<class 'NoneType'>
 None
<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7

### fillna(value, inplace=False)

In [194]:
print(type(df3), '\n', df3)
temp = df3.fillna(0)
print(type(temp), '\n', temp)
print(type(df3), '\n', df3)
temp = df3.fillna(-1, inplace=True)
print(type(temp), '\n', temp)
print(type(df3), '\n', df3)

<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7
<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7
<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7
<class 'NoneType'>
 None
<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7

### astype(type) : 형 변환

In [195]:
print(type(df3), '\n', df3)
temp = df3.astype(int)
print(type(temp), '\n', temp)
print(type(df3), '\n', df3)
print(id(temp) == id(df3)) # False
print(id(temp.loc[0]) == id(df3.loc[0])) # True ???
print(temp.loc[0,3], df3.loc[0,3]) # 5 5.0
print(type(temp.loc[0,3]), type(df3.loc[0,3])) # <class 'numpy.int64'> <class 'numpy.float64'>
print(id(temp.loc[0,3]) == id(df3.loc[0,3])) # False

<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7
<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7
<class 'pandas.core.frame.DataFrame'>
    0  1  2  4  6  7
0  8  8  3  8  3  6
1  5  1  9  4  1  4
2  0  3  9  0  9  2
3  7  7  9  6  3  7
False
True

KeyError: 3

### apply(function, axis=0)

In [ ]:
print(type(df3), '\n', df3)
temp = df3.apply(lambda x : x.max() - x.min()) # 열 방향
print(type(temp), '\n', temp) 
temp = df3.apply(lambda x : x.max() - x.min(), axis=1) # 행 방향
print(type(temp), '\n', temp)
temp = df3.max(axis=1) - df3.min(axis=1)
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
    0  1  2    3  4    5  6  7
0  7  8  3  7.0  8  7.0  6  5
1  1  9  8  6.0  9 -1.0  8  2
2  3  1  2 -1.0  3  8.0  9  7
3  9  1  0  4.0  2  0.0  9  3
<class 'pandas.core.series.Series'>
 0    8.0
1    8.0
2    8.0
3    8.0
4    7.0
5    9.0
6    3.0
7    5.0
dtype: float64
<class 'pandas.core.series.Series'>
 0     5.0
1    10.0
2    10.0
3     9.0
dtype: float64
<class 'pandas.core.series.Series'>
 0     5.0
1    10.0
2    10.0
3     9.0
dtype: float64

### cut(x, bins, lables=None, ...) : 데이터값을 카테고리로 변환
- x : 데이터값 리스트
- bins : 구간 경계값 리스트 (최소값 < 구간 <= 최대값)
- labels : 구간 이름 리스트, 순서는 bins의 순서와 동일해야 함 (len(bins) - 1)

In [ ]:
ages = [0,0.5,4,6,4,5,2,10,21,23,37,15,38,31,61,20,41,31,100]
bins = [0,4,18,25,35,60,100]
labels = ['영유아', '미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
print(type(cats), '\n', cats)
print(type(cats.codes), cats.codes)
print(type(cats.categories), cats.categories)
print(line)
df4 = pd.DataFrame({'나이':ages, '연령대':list(cats)})
temp = df4['연령대'].value_counts()
print(type(temp), '\n', temp)
df4

<class 'pandas.core.arrays.categorical.Categorical'>
 [NaN, '영유아', '영유아', '미성년자', '영유아', ..., '노년', '청년', '장년', '중년', '노년']
Length: 19
Categories (6, object): ['영유아' < '미성년자' < '청년' < '중년' < '장년' < '노년']
<class 'numpy.ndarray'> [-1  0  0  1  0  1  0  1  2  2  4  1  4  3  5  2  4  3  5]
<class 'pandas.core.indexes.base.Index'> Index(['영유아', '미성년자', '청년', '중년', '장년', '노년'], dtype='object')
-----------------------------------------------------------------------------
<class 'pandas.core.series.Series'>
 연령대
영유아     4
미성년자    4
청년      3
장년      3
중년      2
노년      2
Name: count, dtype: int64

       나이   연령대
0     0.0   NaN
1     0.5   영유아
2     4.0   영유아
3     6.0  미성년자
4     4.0   영유아
5     5.0  미성년자
6     2.0   영유아
7    10.0  미성년자
8    21.0    청년
9    23.0    청년
10   37.0    장년
11   15.0  미성년자
12   38.0    장년
13   31.0    중년
14   61.0    노년
15   20.0    청년
16   41.0    장년
17   31.0    중년
18  100.0    노년

### qcut(x, q, labels=None, ...) : 데이터 개수가 같도록 지정한 수의 구간으로 분할 (구간 경계를 미지정)
- x : 분할할 데이터
- q : 구간 수
- labels : 구간 이름 리스트

In [ ]:
# random 정수 20개를 생성하고 4개의 구간(Q1,Q2,Q3,Q4)으로 나누기
np.random.seed(2) # 재실행해도 랜덤정수가 변하지 않도록 처리
data = np.random.randint(20, size=20)
qcat = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
print(type(data), np.sort(data))
print(type(qcat), '\n', qcat)
print(type(qcat.codes), qcat.codes)
print(type(qcat.categories), qcat.categories)
temp = qcat.value_counts()
print(type(temp), '\n', temp)
print(line)
df5 = pd.DataFrame(data, columns=["관측수"])
df5["범주"] = qcat
df5

<class 'numpy.ndarray'> [ 2  3  4  5  6  7  7  8  8  8 10 11 11 11 11 13 15 15 17 18]
<class 'pandas.core.arrays.categorical.Categorical'>
 ['Q2', 'Q4', 'Q4', 'Q2', 'Q3', ..., 'Q1', 'Q1', 'Q1', 'Q3', 'Q3']
Length: 20
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']
<class 'numpy.ndarray'> [1 3 3 1 2 3 2 1 1 0 3 2 3 0 1 0 0 0 2 2]
<class 'pandas.core.indexes.base.Index'> Index(['Q1', 'Q2', 'Q3', 'Q4'], dtype='object')
<class 'pandas.core.series.Series'>
 Q1    5
Q2    5
Q3    5
Q4    5
Name: count, dtype: int64
-----------------------------------------------------------------------------

    관측수  범주
0     8  Q2
1    15  Q4
2    13  Q4
3     8  Q2
4    11  Q3
5    18  Q4
6    11  Q3
7     8  Q2
8     7  Q2
9     2  Q1
10   17  Q4
11   11  Q3
12   15  Q4
13    5  Q1
14    7  Q2
15    3  Q1
16    6  Q1
17    4  Q1
18   10  Q3
19   11  Q3

### set_index(keys, inplace=False, verify_integrity=False) : <br>기존 행 인덱스를 제거하고 열 중 하나를 인덱스로 설정
- keys : 인덱스로 설정할 열의 키값
- inplace : True로 설정하면 원본에 반영
- verify_integrity : True로 설정하면 중복된 키값이 있는지 확인

In [ ]:
df6 = pd.DataFrame({
    'a': [1, 3, 4, 3, 4],
    'b': [2, 3, 1, 4, 5],
    'c': [1, 5, 2, 4, 4]
})
print(type(df6), "\n", df6)
print(type(df6.index), df6.index)
temp = df6.set_index("a")
print(type(temp), "\n", temp)
print(type(temp.index), temp.index)
temp = df6.set_index(["a", "b"])
print(type(temp), "\n", temp)
print(type(temp.index), temp.index)
df6.set_index(["c"], inplace=True, verify_integrity=True)
df6 # [중료] 인덱스로 설정할 때 중복된 키값이 존재해도 는데 정상적으로 인덱스로 설정되는 문제 (verify_integrity을 True로 설정하면 ValueError 발생)
df6.loc[4] = [np.nan, np.nan]
df6 # row index 4인 행이 모두 변경됨

<class 'pandas.core.frame.DataFrame'>
    a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4
<class 'pandas.core.indexes.range.RangeIndex'> RangeIndex(start=0, stop=5, step=1)
<class 'pandas.core.frame.DataFrame'>
    b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4
<class 'pandas.core.indexes.base.Index'> Index([1, 3, 4, 3, 4], dtype='int64', name='a')
<class 'pandas.core.frame.DataFrame'>
      c
a b
1 2  1
3 3  5
4 1  2
3 4  4
4 5  4
<class 'pandas.core.indexes.multi.MultiIndex'> MultiIndex([(1, 2),
            (3, 3),
            (4, 1),
            (3, 4),
            (4, 5)],
           names=['a', 'b'])

ValueError: Index has duplicate keys: Index([4], dtype='int64', name='c')

### reset_index() : 기존 행 인덱스를 제거하고 기본 인덱스로 변경 (0부터 1씩 증가하는 정수 인덱스)

In [ ]:
print(type(df6), "\n", df6)
temp = df6.reset_index()
print(type(temp), "\n", temp)

<class 'pandas.core.frame.DataFrame'>
    a  b
c
1  1  2
5  3  3
2  4  1
4  3  4
4  4  5
<class 'pandas.core.frame.DataFrame'>
    c  a  b
0  1  1  2
1  5  3  3
2  2  4  1
3  4  3  4
4  4  4  5

## 병합

### merge(right, on, how="inner", ...)
- right : DataFrame or Series
- on : 병합시 기준이 되는 컬럼의 키값 (생략시 자동으로 컬럼명이 같은 컬럼으로 병합)
- how : 병합방법
    1. inner : 교집합
    2. outer : 합집합
    3. right : 오른쪽 테이블 기준
    4. left : 왼쪽 테이블 기준

In [ ]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액' : [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])

In [ ]:
temp = df1.merge(df2)
print(type(temp), "\n", temp)
temp = pd.merge(df1, df2, on="고객번호", how="inner")
print(type(temp), "\n", temp)
df1
df2

<class 'pandas.core.frame.DataFrame'>
    고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000
<class 'pandas.core.frame.DataFrame'>
    고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [ ]:
temp = df1.merge(df2, on="고객번호", how="outer")
print(type(temp), "\n", temp)
temp = pd.merge(df1, df2, on="고객번호", how="outer")
print(type(temp), "\n", temp)

<class 'pandas.core.frame.DataFrame'>
    고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0
<class 'pandas.core.frame.DataFrame'>
    고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [ ]:
temp = df1.merge(df2, on="고객번호", how="right")
print(type(temp), "\n", temp)
temp = pd.merge(df1, df2, on="고객번호", how="right")
print(type(temp), "\n", temp)

<class 'pandas.core.frame.DataFrame'>
    고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [ ]:
temp = df1.merge(df2, on="고객번호", how="left")
print(type(temp), "\n", temp)
temp = pd.merge(df1, df2, on="고객번호", how="left")
print(type(temp), "\n", temp)

<class 'pandas.core.frame.DataFrame'>
    고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [ ]:
temp = pd.merge(df1, df2, on="고객번호", how="left")
print(type(temp), "\n", temp)

<class 'pandas.core.frame.DataFrame'>
    고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [ ]:
# [setosa] df1:(1.4, 1.3), df2:(0.4)
# [versicolor] df1 2개 x df2 2개 = 4개로 생성
df1 = pd.DataFrame({
    '품종': ['setosa', 'setosa', 'virginica', 'virginica'],
    '꽃잎길이': [1.4, 1.3, 1.5, 1.3]
}, columns=['품종', '꽃잎길이'])
df2 = pd.DataFrame({
    '품종': ['setosa', 'virginica', 'virginica', 'ersicolor'],
    '꽃잎너비': [0.4, 0.3, 0.5, 0.3]
}, columns=['품종', '꽃잎너비'])
temp = pd.merge(df1, df2) # on='품종', how='inner'
temp

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [ ]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': [20000, 30000, 100000]})
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'], 
    '데이터': ['여자', '남자']})
df1
df2
temp = pd.merge(df1, df2, on='고객명')
temp

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

  고객명 데이터
0  춘향  여자
1  몽룡  남자

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

In [ ]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [90, 80, 80]
})
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [100, 80, 90]
})
df1
df2
pd.merge(df1, df2, left_on='이름', right_on='성명') # how='inner'

   이름  성적
0  영희  90
1  철수  80
2  철수  80

   성명  성적2
0  영희  100
1  영희   80
2  철수   90

   이름  성적  성명  성적2
0  영희  90  영희  100
1  영희  90  영희   80
2  철수  80  철수   90
3  철수  80  철수   90

In [ ]:
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]
})
df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[
        ['부산', '부산', '서울', '서울', '서울', '서울'],
        [2000, 2005, 2000, 2005, 2010, 2015]
    ], columns=['데이터1', '데이터2'])
df1
df2
temp = df2.loc['부산'].loc[2000]
print(type(temp), '\n', temp)

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

<class 'pandas.core.series.Series'>
 데이터1    0
데이터2    1
Name: 2000, dtype: int64

### join(...) : 사용법은 merge와 동일

### concat

## Pivot Table

### pivot_table(data,values=None,index=None,columns=None,aggfunc='mean',margins=False,margins_name='All')
- data : 분석할 DataFrame, 메서드 형식일때는 필요하지 않음 (ex : df1.pivot_table())
- values : 분석할 DataFrame에서 분석할 열
- index : 행 인덱스로 들어갈 키열 또는 키열의 리스트
- columns : 열 인덱스로 들어갈 키열 또는 키열의 리스트
- aggfunc : 분석할 데이터의 집계 함수
- fill_value : NaN이 표출될 때 대체값 지정
- margins : 모든 데이터를 분석한 결과를 행으로 표출할 지 여부
- margins_name : margins가 표출될 때 그 열(행)의 이름
#### 피봇테이블을 작성할 때 반드시 설정해야 되는 인수
- data : 사용 데이터 프레임
- index : 행 인덱스로 사용할 필드(기준 필드로 작용됨)
- 인덱스 명을 제외한 나머지 값(data)은 수치 data 만 사용함
- 기본 함수가 평균(mean)함수 이기 때문에 각 데이터의 평균값이 반환

In [ ]:
data_dic = {
"도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
"연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
"인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
"지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns_list = ["도시", "연도", "인구", "지역"]
df = pd.DataFrame(data_dic, columns=columns_list)
df

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [ ]:
# 각 도시에 대한 연도별 인구
df.pivot_table(index="도시", columns='연도',values='인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [ ]:
# 각 지역별 도시에 대한 연도별 인구
df.pivot_table(index=["지역","도시"],columns="연도", values="인구")

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

In [ ]:
import seaborn as sns

df = sns.load_dataset('titanic')[['age','sex','class','fare','survived','alive']]
df.head(3)
# 각 선실 등급별 숙박객의 성별에따른 생존자 수와 생존율
pdf = pd.pivot_table(df, index = 'class', columns = 'sex', values='survived', aggfunc=['mean','sum'])
pdf
# 선실 등급에 따른 성별에 대해 생존여부별로 나이와 티켓값의 평균과 최대값을 산출
pdf = pd.pivot_table(df, index = ['class','sex'], columns = 'alive', values = ['age','fare'], aggfunc = ['mean','max'])
pdf

    age     sex  class     fare  survived alive
0  22.0    male  Third   7.2500         0    no
1  38.0  female  First  71.2833         1   yes
2  26.0  female  Third   7.9250         1   yes

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

                    mean                                      max        \
                     age                   fare               age
alive                 no        yes          no         yes    no   yes
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
alive              no       yes
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958

## Group 분석

### groupby(...)

#### <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [ ]:
# <class 'pandas.core.groupby.generic.DataFrameGroupBy'> = df.groupby(Series)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2
grps = df2.groupby(df2["key1"])
print(type(grps))
print(type(grps.groups), grps.groups)
grps.groups.keys()
grps.groups.values()
grps.groups.items()
grps.groups['A']

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<class 'pandas.io.formats.printing.PrettyDict'> {'A': [0, 1, 4], 'B': [2, 3]}

dict_keys(['A', 'B'])

dict_values([Index([0, 1, 4], dtype='int64'), Index([2, 3], dtype='int64')])

dict_items([('A', Index([0, 1, 4], dtype='int64')), ('B', Index([2, 3], dtype='int64'))])

Index([0, 1, 4], dtype='int64')

In [ ]:
# DataFrameGroupBy 객체를 사용하여 DataFrame 생성한 경우 데이터 구조
gdf = pd.DataFrame(grps)
temp = gdf.loc[0].values
print(type(temp[0]), temp[0]) # String (Group 값)
print(type(temp[1]), '\n', temp[1]) # DataFrame (Group 값에 해당하는 DataFrame)
print(type(temp), '\n', temp)
temp = gdf.loc[1].values
print(type(temp), '\n', temp)

<class 'str'> A
<class 'pandas.core.frame.DataFrame'>
   key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
4    A  one      5     50
<class 'numpy.ndarray'>
 ['A'   key1 key2  data1  data2
     0    A  one      1     10
     1    A  two      2     20
     4    A  one      5     50]
<class 'numpy.ndarray'>
 ['B'   key1 key2  data1  data2
     2    B  one      3     30
     3    B  two      4     40]

In [ ]:
# DataFrameGroupBy.sum() 함수의 사용 예시
temp = grps.sum() # DataFrame
print(type(temp), '\n', temp)
temp = grps.sum()['data1']
print(type(temp), '\n', temp)
temp = grps['data1'].sum() # Series
print(type(temp), '\n', temp)
temp = grps[['data1']].sum() # DataFrame
print(type(temp), '\n', temp)

<class 'pandas.core.frame.DataFrame'>
            key2  data1  data2
key1
A     onetwoone      8     80
B        onetwo      7     70
<class 'pandas.core.series.Series'>
 key1
A    8
B    7
Name: data1, dtype: int64
<class 'pandas.core.series.Series'>
 key1
A    8
B    7
Name: data1, dtype: int64
<class 'pandas.core.frame.DataFrame'>
       data1
key1
A         8
B         7

#### DataFrameGroupBy.agg(function)
- DF 등에 벡터라이징 연산을 적용하는 함수(axis = 0/1 이용하여 행/열 적용가능)
- agg 함수는 숫자 타입의 스칼라만 리턴하는 함수를 적용 (apply의 특수한 경우, 처리속도가 apply보다 빠름)
- 스칼라 : 하나의 수치(數値)만으로 완전히 표시되는 양. 방향의 구별이 없는 물리적 수량임. 질량·에너지·밀도(密度)·전기량(電氣量)

In [ ]:
import seaborn as sns
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
# iris 품종별로 Grouping
ig = iris.groupby("species")
ig.mean()
idf = pd.DataFrame(ig)
versicolor_df = idf.loc[1].values[1]
versicolor_df.head()
versicolor_df.max()
versicolor_df["sepal_width"].max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor

sepal_length           7.0
sepal_width            3.4
petal_length           5.1
petal_width            1.8
species         versicolor
dtype: object

3.4

In [ ]:
print("# ig['petal_length'].sum()")
#temp = ig['petal_length'].sum() # Series 
temp = ig.petal_length.sum() # Series 
print(type(temp), '\n', temp)
print("\n# ig.max() / ig.min()")
temp = ig.max() / ig.min() # DataFrame
print(type(temp))
temp
print("\n# ig.agg(lambda s: s.max() / s.min())")
temp = ig.agg(lambda s: s.max() / s.min()) # DataFrame
print(type(temp))
temp

# ig['petal_length'].sum()
<class 'pandas.core.series.Series'>
 species
setosa         73.1
versicolor    213.0
virginica     277.6
Name: petal_length, dtype: float64

# ig.max() / ig.min()
<class 'pandas.core.frame.DataFrame'>

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

# ig.agg(lambda s: s.max() / s.min())
<class 'pandas.core.frame.DataFrame'>

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

#### DataFrameGroupBy.apply(fucntion)

In [ ]:
print("\n# ig.apply(lambda s: s.max() / s.min())")
temp = ig.apply(lambda s: s.max() / s.min()) # DataFrame
print(type(temp))
temp
print("\n# ig.apply(lambda df: df.sort_values(by='petal_length', ascending=False)[:3])")
temp = ig.apply(lambda df: df.sort_values(by='petal_length', ascending=False)[:3]) # DataFrame
#print(type(temp.columns), '\n', temp.columns)
#print(type(temp.index), '\n', temp.index)
print(type(temp))
temp

# ig.apply(lambda s: s.max() / s.min())
<class 'pandas.core.frame.DataFrame'>

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

# ig.apply(lambda df: df.sort_values(by='petal_length', ascending=False)[:3])
<class 'pandas.core.frame.DataFrame'>

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     44            5.1          3.8           1.9          0.4
           24            4.8          3.4           1.9          0.2
           18            5.7          3.8           1.7          0.3
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           52            6.9          3.1           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     44       setosa
           24       setosa
           18       setosa
versicolor 83   versicolor
           77   versicolor
           52   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

In [199]:
func = lambda s: pd.qcut(s, 3, labels=["small", "medium", "large"])
temp = ig.petal_length.apply(func).astype(str) # Series
temp.reset_index(drop=True, inplace=True) # temp.index가 MultiIndex이므로 default index로 변경 (iris DataFrame에 추가하기 위해)
print(type(temp))
temp
iris['petal_length_class'] = temp
iris.tail()

<class 'pandas.core.series.Series'>

0       small
1       small
2       small
3      medium
4       small
        ...
145     small
146     small
147     small
148    medium
149     small
Name: petal_length, Length: 150, dtype: object

,sepal_length,sepal_width,petal_length,petal_width,species,petal_length_class
145,6.7,3.0,5.2,2.3,virginica,small
146,6.3,2.5,5.0,1.9,virginica,small
147,6.5,3.0,5.2,2.0,virginica,small
148,6.2,3.4,5.4,2.3,virginica,medium
149,5.9,3.0,5.1,1.8,virginica,small

#### example (sns tips)

In [238]:
import seaborn as sns
tips = sns.load_dataset("tips")
print(type(tips))
tips.tail()

# 팁 비율 및 레벨 구분
tips['tip_ratio'] = tips['tip'] / tips['total_bill']
temp = pd.cut(tips.tip_ratio, bins=[0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8], labels=["1", "2", "3", "4", "5", "6", "7", "8"])
tips['tip_ratio_lv'] = temp
tips.tail()
tips.tip_ratio.mean() # 16%

# 데이터 현황 분석
tips.groupby('tip_ratio_lv').tip_ratio.describe()
temp = tips[tips.tip_ratio > 0.2] # 전체 평균이 16%이므로 20% 이상 추출
temp.groupby('sex').tip_ratio.describe()
temp.groupby('smoker').tip_ratio.describe()
temp.groupby('day').tip_ratio.describe()
temp.groupby('time').tip_ratio.describe()
temp.groupby('size').tip_ratio.describe() # 2명의 경우 가장 많음
temp.groupby(['size','sex']).tip_ratio.describe() # 2명의 남자인 경우가 더 많음

<class 'pandas.core.frame.DataFrame'>

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

,total_bill,tip,sex,smoker,day,time,size,tip_ratio,tip_ratio_lv
239,29.03,5.92,Male,No,Sat,Dinner,3,0.203927,3
240,27.18,2.00,Female,Yes,Sat,Dinner,2,0.073584,1
241,22.67,2.00,Male,Yes,Sat,Dinner,2,0.088222,1
242,17.82,1.75,Male,No,Sat,Dinner,2,0.098204,1
243,18.78,3.00,Female,No,Thur,Dinner,2,0.159744,2

np.float64(0.16080258172250472)

,count,mean,std,min,25%,50%,75%,max
tip_ratio_lv,,,,,,,,
1,27.0,0.078495,0.015241,0.035638,0.072383,0.078927,0.089118,0.099843
2,178.0,0.154173,0.026979,0.101163,0.136395,0.152835,0.175747,0.199873
3,36.0,0.228360,0.024939,0.200343,0.206220,0.222020,0.241357,0.291990
4,1.0,0.325733,NaN,0.325733,0.325733,0.325733,0.325733,0.325733
5,1.0,0.416667,NaN,0.416667,0.416667,0.416667,0.416667,0.416667
6,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,1.0,0.710345,NaN,0.710345,0.710345,0.710345,0.710345,0.710345

,count,mean,std,min,25%,50%,75%,max
sex,,,,,,,,
Male,24.0,0.249604,0.100833,0.203927,0.214162,0.226300,0.241357,0.710345
Female,15.0,0.245548,0.059707,0.200343,0.204944,0.220264,0.261397,0.416667

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
Yes,16.0,0.285156,0.125093,0.205577,0.222898,0.241716,0.279777,0.710345
No,23.0,0.222227,0.023177,0.200343,0.204450,0.218539,0.227899,0.291990

,count,mean,std,min,25%,50%,75%,max
day,,,,,,,,
Thur,10.0,0.220374,0.021281,0.200343,0.205303,0.212649,0.232264,0.266312
Fri,4.0,0.241709,0.022843,0.220264,0.222898,0.241545,0.260356,0.263480
Sat,10.0,0.239042,0.043938,0.203927,0.205718,0.220982,0.267329,0.325733
Sun,15.0,0.274182,0.131480,0.202195,0.219025,0.228050,0.247425,0.710345

,count,mean,std,min,25%,50%,75%,max
time,,,,,,,,
Lunch,12.0,0.223903,0.022268,0.200343,0.207745,0.216304,0.237873,0.266312
Dinner,27.0,0.258774,0.101593,0.202195,0.210266,0.227747,0.258076,0.710345

,count,mean,std,min,25%,50%,75%,max
size,,,,,,,,
1,2.0,0.274755,0.072094,0.223776,0.249265,0.274755,0.300244,0.325733
2,29.0,0.252206,0.097889,0.200343,0.208967,0.224921,0.252672,0.710345
3,5.0,0.216490,0.012246,0.203927,0.206246,0.213789,0.227747,0.230742
4,2.0,0.243056,0.053004,0.205577,0.224316,0.243056,0.261796,0.280535
5,1.0,0.241663,NaN,0.241663,0.241663,0.241663,0.241663,0.241663

             count      mean       std       min       25%       50%  \
size sex
1    Male      1.0  0.223776       NaN  0.223776  0.223776  0.223776
     Female    1.0  0.325733       NaN  0.325733  0.325733  0.325733
2    Male     17.0  0.258440  0.118598  0.204082  0.218539  0.227679
     Female   12.0  0.243375  0.061540  0.200343  0.203280  0.215887
3    Male      3.0  0.215154  0.011969  0.203927  0.208858  0.213789
     Female    2.0  0.218494  0.017321  0.206246  0.212370  0.218494
4    Male      2.0  0.243056  0.053004  0.205577  0.224316  0.243056
5    Male      1.0  0.241663       NaN  0.241663  0.241663  0.241663

                  75%       max
size sex
1    Male    0.223776  0.223776
     Female  0.325733  0.325733
2    Male    0.241255  0.710345
     Female  0.260356  0.416667
3    Male    0.220768  0.227747
     Female  0.224618  0.230742
4    Male    0.261796  0.280535
5    Male    0.241663  0.241663

# 끝